'''
Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень). Напишите решения через list и через dict.
'''

'''
РЕШЕНИЕ САМОСТОЯТЕЛЬНОЕ
'''
# while True:
#     usr_input = input("Введите номер месяца: ")
#     if usr_input.isdigit():
#         num = int(usr_input)
#         break
#     else:
#       print ("Введено не число")
#
# my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
# dict = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето", 9: "осень",
#             10: "осень", 11: "осень", 12: "зима"}
# print(dict.get(num))

'''
РЕШЕНИЕ ПРЕПОДАВАТЕЛЯ
'''
seasons = ('зима',
           'весна',
           'лето',
           'осень')

usr_input = int(input("Введите номер месяца: "))

seasons_idx = usr_input // 3 % 4
print(seasons_idx)
print(seasons[seasons_idx])